//***********************************************************************************
// 文件名称：SlotAttrTypeEnum.cs
// 功能描述：卡槽属性枚举（属性变动的模块对应的枚举）
// 数据表：无
// 作者：Allen 彭亚川
// 日期：2017/5/23 13:09:47
// 修改记录：
//***********************************************************************************

namespace PycMono.Project.Slot
{
    /// <summary>
    /// 卡槽属性枚举（属性变动的模块对应的枚举）
    /// </summary>
    public enum SlotAttrTypeEnum
    {
        /// <summary>
        /// 装备
        /// </summary>
        Equip = 1,

        // 你可以定义其他枚举
        // 比如至宝，坐骑之类的模块就加一个枚举增加一个实现类就ok了
    }
}
